# -*- coding: utf-8 -*-

# базовая величина
BASE_VALUE = 42

# границы диапазонов стоимости автомобиля
VEHICLE_PRICE_LIMIT_1 = 15000
VEHICLE_PRICE_LIMIT_2 = 30000
VEHICLE_PRICE_LIMIT_3 = 50000

# коэффициенты страхования ОПТИМА Вариант А
OPTIMA_A_RATES =  [
    [5.53, 4.22, 3.89, 3.76],
    [5.75, 4.39, 4.04, 3.91]
]

# коэффициенты страхования ОПТИМА Вариант Б
OPTIMA_B_RATES =  [
    [5.26, 4.01, 3.69, 3.57]
]

# коэффициенты страхования ПРОФИТ Вариант А
PROFIT_A_RATES =  [
    [4.7, 3.59, 3.30, 3.20],
    [4.89, 3.73, 3.44, 3.32]
]

# коэффициенты страхования ПРОФИТ Вариант Б
PROFIT_B_RATES =  [
    [4.47, 3.41, 3.14, 3.04]
]

# границы диапазонов возраста водителя
DRIVER_AGE_LIMIT_1 = 16
DRIVER_AGE_LIMIT_2 = 25
DRIVER_AGE_LIMIT_3 = 35

# коэффициенты от возраста водителя
DRIVER_RATES = [
    [1.15, 1.1, 1.05],
    [1.05, 1.0, 1.0],
    [1.0, 0.95, 0.85]
]

# коэффициенты мультидрайва
MULTIDRIVE = 1.15
MULTIDRIVE_BELGEE = 1.05
MULTIDRIVE_2 = 1.00
MULTIDRIVE_YUL_IP = 1.00

# коэффициент за территорию
TERRITORY_RB_ONLY = 0.95
TERRITORY_ALL = 1.00
